[
  {
    "year": "2020",
    "title": "Graduation",
    "description": "Graduated with B.Tech in Computer Science & Engineering from College of Technology & Engineering, Udaipur. Started my journey in Android development with a passion for creating intuitive mobile experiences.",
    "type": "milestone",
    "icon": "🎓"
  },
  {
    "year": "2021",
    "title": "Alyve Health - First Steps",
    "description": "Migrated legacy applications to modern MVVM architecture, reducing technical debt and setting the foundation for faster development cycles.",
    "type": "career",
    "icon": "💼"
  },
  {
    "year": "2021 - 2024",
    "title": "Delhivery - Building at Scale",
    "description": "Transformed internal tools into public-facing marketplaces, architected multi-app systems with offline-first capabilities, and built reusable component libraries. Contributed to Go microservices and event-driven architectures handling high-volume logistics workflows.",
    "type": "career",
    "icon": "🚀"
  },
  {
    "year": "2024 - Present",
    "title": "Velotio Technologies - Pushing Boundaries",
    "description": "Working on cutting-edge audio technology, building the DTS Play-Fi App that delivers premium wireless audio experiences across 17+ languages. Leading development of spatial computing applications for Android XR devices.",
    "type": "career",
    "icon": "🎵"
  },
  {
    "year": "Ongoing",
    "title": "Life Beyond Code",
    "description": "Riding my BMW G 310 GS through mountains, traveling across India, writing poetry and tech blogs, staying fit, and planning scuba diving adventures. Life beyond code makes me a better engineer.",
    "type": "personal",
    "icon": "🌊"
  },
  {
    "year": "Philosophy",
    "title": "Core Values",
    "description": "Building for scale with architecture that grows with the product. Offline-first thinking for seamless experiences. Code quality over velocity. Full-stack understanding. Continuous learning as technology evolves.",
    "type": "philosophy",
    "icon": "💡"
  }
]


